Revit 2024 API
IFCTransformSetter.Initialize Method
 Initializes the transformation in the transform setter.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public void Initialize(
	ExporterIFC exporterIFC,
	Transform transform
)
Visual Basic
Public Sub Initialize ( _
	exporterIFC As ExporterIFC, _
	transform As Transform _
)
Visual C++
public:
void Initialize(
	ExporterIFC^ exporterIFC,
	Transform^ transform
)
Parameters
exporterIFC
Type: Autodesk.Revit.DB.IFC.ExporterIFC
 The exporter.
transform
Type: Autodesk.Revit.DB.Transform
 The transform.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
IFCTransformSetter Class
Autodesk.Revit.DB.IFC Namespace